---
kind: other
id: Properties.T:Autodesk.Revit.DB.ColorFillLegend
source: html/3a9f5241-80d9-ee0b-f4d9-8fa97a4464ae.htm
---
# ColorFillLegend Properties

The id of the assembly instance to which the element belongs.